<template>
  <div class="about container">
    <h1>Задание</h1>
    <p>
      Необходимо реализовать страницу поиска сотрудников, с предпросмотром
      профиля.
    </p>

    <p>
      Приложение состоит из двух страниц, в sidebar осуществляется поиск и
      отображение результатов.
    </p>
    <p>На главной отображается карточка пользователя с личными данными.</p>

    <p>Готовый проект выложите на github.</p>
    <p>Учесть при выполнении ТЗ:</p>
    <ul>
      <li>
        Можно искать, как одного пользователя, так и нескольких (допустим Bret,
        Antonette).
      </li>
      <li>
        Поиск должен работать по полю id и полю username либо name, на ваше
        усмотрение.
      </li>
      <li>
        При выборе способа получения пользователя(пользователей) и фильтрации
        учитывать, что их может быть больше 2000 человек.
      </li>
      <li>
        При изменении состояния в sidebar, страница с профилем пользователя
        должна менять свое состояние, т.е если открыт профиль пользователя и
        потом решили удалить все из строки поиска, очищается список найденных
        пользователей, и страница отображения профиля возвращается в исходное
        состояние. Sidebar
      </li>
      <li>
        В строке поиска пользователя необходимо реализовать запрос к API для
        получения необходимых юзеров.
      </li>
      <li>
        В случае если результат вернул ошибку (параметры запроса неверные, либо
        ошибка сервера), необходимо отобразить эту ошибку пользователю.
      </li>
      <li>
        После успешно выполненного запроса, необходимо отобразить полученного
        пользователя или пользователей в интерфейсе.
      </li>
    </ul>
    <p>Шрифт</p>
    <p>
      В проекте используется шрифт Montserrat
      https://fonts.google.com/specimen/Montserrat
    </p>

    <p>Обязательно:</p>

    <p>1.SPA должно быть реализовано с использованием Vue,Vuex.</p>

    <p>2.Необходимо создать основные компоненты.</p>

    <p>3.Использовать actions, mutations.</p>

    <p>3.Стили должны быть написаны с помощью препроцессора Scss</p>

    <p>
      4.Во время всех запросов нужно сигнализировать пользователю через
      прелоадер, что происходит запрос.
    </p>

    <p>5.Использовать изоляцию стилей.</p>

    <p>Документация API</p>
    <p>https://jsonplaceholder.typicode.com</p>

    <p>Пример запроса для одного пользователя по id:</p>
    <p>https://jsonplaceholder.typicode.com/users?id=1</p>
    method: GET

    <p>Пример запроса для нескольких пользователей по id:</p>
    <p>https://jsonplaceholder.typicode.com/users?id=1&id=2</p>
    method: GET
  </div>
</template>
